/*
1. Имя переменной должно объяснять, что ПО СМЫСЛУ хранится в ней
(а не по значению);
userName - имя пользователя;
userAge - возраст пользоавтеля
carBrand - марка машины
name - чье имя?
age - чей возраст?
x - непонятно?
Вывод: имя переменных часто состоят из двух и больше слов.
Исключение - код в фигурных скобках, после которых эти переменные
все равно умрут. 
2. Имя переменных - всегда существительные. 
3. camelCase - если имя переменной состоит больше чем из одного слова,
то первое слово пишется с маленькой буквы, а все последующие - с большой:
bankName
formInput
*/