/*
У массива так же есть динамическое (то есть оно меняется при изменении размера массива)
свойство length, равное количеству элементов в массиве
(обратите внимание - не индексу последнего элемента,
а количеству элементов в массива).
*/
const soldiers = ["Румол", "Шаграт", "Ридзер", "Питер"];

console.log(`Количество солдат в вашем отряде = ${soldiers.length}`);

/* Следовательно, для перебора всего массива можно использовать цикл for,
главное - правильно написать  начальное значение и условие:
- i изначально равен 0, потому что индекс первого элемента массива всегда 0;
- i должно быть меньше длины массива, потому что длина массива (length) -
  это всегда индекс последнего элемента + 1
*/
// length = индекс_последнего_элемента + 1
for (let i = 0; i < soldiers.length; i +=1) {
    console.log(soldiers[i]);
}